{
  "description": {
    "navbar": {
      "link1": "About us",
      "link2": "Projects",
      "link3": "Partners",
      "link4": "Contacts",
      "link5": "Our mission"
    },
    "our-mission": {
      "title": "Our mission",
      "item-1": "Exchange of information and personal communication of researchers and admirers of the figure and work of Ivan Franko in Ukraine and abroad;",
      "item-2": "Popularization of the worldview and creativity of Ivan Franko in the Ukrainian information space and system of higher and secondary education, promotion of familiarization with them to the world community",
      "item-3": "Support, stimulation and coordination of studies about Franko",
      "item-4": "Interaction with state, scientific and educational, cultural and artistic, public institutions, organizations, associations of Ukraine and other states to ensure the further development of Franko studies."
    },
    "intro": {
      "main-title": "Association of museums of Ivan Franko"
    },
    "about-us": {
      "general-info": "«The Ivan Franko Museums Association» is a non-profit public organization that works on establishing cooperation with Ivan Franko museums for joint efforts in perpetuating the memory of the distinguished Ukrainian writer, thinker, and public-political figure Ivan Franko, researching and popularizing his spiritual legacy in Ukraine and beyond. The NGO \"Association of Ivan Franko Museums\" has no direct sources of funding. The public organization carries out its activities by implementing grant projects and thanks to charitable contributions. There is no material-technical base or staffing provision. The activities of the organization are carried out based on the Lviv National Literary-Memorial Museum of Ivan Franko.",
      "franko-quote": "A person should be great not by the magnitude of their achievements, but by the greatness of their dreams.",
      "franko-name": "Ivan Franko",
      "about-us-title": "About Us",
      "who-we": "Who We Are",
      "our-mission": "Our mission is to unite museums dedicated to Ivan Franko for collaborative efforts in preserving and promoting his legacy in Ukraine and beyond.",
      "our-occupation": "What We Do",
      "list-of-occupation": {
        "item1": "Research",
        "item2": "Popularization",
        "item3": "Communication",
        "item4": "Interaction"
      },
      "info-line": {
        "title": "Information Line",
        "contacts": "Contacts",
        "telephone": "tel.:"
      },
      "adress": "Ivana Franka Street, 150, 152, Lviv, Lviv region, 79000"
    },

    "events": {
      "title": "Events"
    },

    "partners": {
      "title": "Partners"
    },

    "museumsFranko": {
      "title": "Museums of Ivan Franko",
      "card-info": {
        "phone": "Phone:",
        "workingHours": "Working hours:",
        "address": "Address:",
        "email": "Email address:",
        "website": "Website:"
      }
    },

    "footer": {
      "links": {
        "about-us": "About us",
        "projects": "Projects",
        "contacts": "Contacts",
        "museums": "Museums",
        "partners": "Partners",
        "our-mission": "Our mission"
      },
      "contacts": {
        "contacts": "Contacts",
        "phone": "Tel.: +38096 158 46 06"
      },
      "address": {
        "address": "Address",
        "country": "Ukraine, 79011",
        "position": "Lviv Region, Lviv City, 152 Ivana Franka Street"
      }
    }
  }
}
