{
  "description": {
    "navbar": {
      "link1": "Про нас",
      "link2": "Проекти",
      "link3": "Партнери",
      "link4": "Контакти",
      "link5": "Наша місія"
    },

    "intro": {
      "main-title": "\"Асоціація музеїв Івана Франка\""
    },

    "our-mission": {
      "title": "Наша місія",
      "item-1": "Обмін інформацією та особистісна комунікації дослідників і шанувальників постаті й творчості Івана Франка в Україні та закордоном",
      "item-2": "Популяризація світогляду та творчості Івана Франка в українському інформаційному просторі та системі вищої і середньої освіти, сприяння ознайомлення з ними світової спільноти",
      "item-3": "Підтримка, стимулювання та координація франкознавчих досліджень",
      "item-4": "Взаємодія з державними, науково-освітніми, культурно-мистецькими, громадськими установами, організаціями, об'єднаннями України та інших держав задля уможливлення подальшого розвитку франкознавства."
    },

    "about-us": {
      "general-info": "«Асоціація Музеїв Івана Франка» - це неприбуткова громадська організація, яка працює над налагодженням співпраці із музеями Івана Франка для спільної роботи над увічненням пам’яті видатного українського письменника, мислителя, громадсько-політичного діяча Івана Франка, дослідження та популяризація його духовної спадщини в Україні та поза її межами. Безпосередні джерела фінансування «Асоціації Музеїв Івана Франка» відсутні. Громадська організація здійснює свою діяльність у рамках отриманих грантових проєктів та благодійних внесків. Матеріально-технічна база та кадрове забезпечення відсутні. Діяльність організації здійснюється на базі «Львівського національного літературно-меморіального музею Івана Франка».",
      "franko-quote": "Людина повинна бути великою не за величезністю своїх досягнень, а за величчю своїх мрій.",
      "franko-name": "Іван Франко",
      "about-us-title": "Про нас",
      "who-we": "Хто ми",
      "our-mission": "Наша місія - об'єднати музеї, які присвячені Івану Франку, для спільної роботи над збереженням та популяризацією його спадщини в Україні та за її межами.",
      "our-occupation": "Чим ми займаємось?",
      "list-of-occupation": {
        "item1": "Дослідження",
        "item2": "Популяризація",
        "item3": "Комунікація",
        "item4": "Взаємодія"
      },
      "info-line": {
        "title": "Інформаційна лінія",
        "contacts": "Контакти",
        "telephone": "Тел.:"
      },
      "adress": "вулиця Івана Франка, 150, 152, Львів, Львівська область, 79000"
    },

    "events": {
      "title": "Наші проєкти"
    },

    "partners": {
      "title": "Партнери"
    },

    "museumsFranko": {
      "title": "Музеї Івана Франка"
    },

    "footer": {
      "links": {
        "about-us": "Про нас",
        "projects": "Проекти",
        "contacts": "Контакти",
        "museums": "Музеї",
        "partners": "Партнери",
        "our-mission": "Наша місія"
      },
      "contacts": {
        "contacts": "Контакти",
        "phone": "Тел.: +38096 158 46 06"
      },
      "address": {
        "address": "Адреса",
        "country": "Україна, 79011",
        "position": "Львівська область, місто Львів, вулиця Івана Франка 152"
      }
    }
  }
}
