import React from "react";
import TeenagerImg from "../../assets/NewsBoardImages/tvm-0 1.png";
import { NewsBlock, NewsContainer, TitleProjects } from "../../components/styles/NewsBoardStyle";
import NewsPiece from "./NewsPiece";

function NewsBoard() {
  const data = [
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
  ];
  return (
    <NewsBlock>
      <TitleProjects>Проекти</TitleProjects>
      <NewsContainer>
        {data.map((piecenews, index) => {
          return (
            <NewsPiece
              image={piecenews.image}
              title={piecenews.title}
              shortText={piecenews.shortText}
              key={index}
            />
          );
        })}
      </NewsContainer>
    </NewsBlock>
  );
}

export default NewsBoard;
