import React, { useState } from "react";
import { Pagination } from "@mui/material";
import Stack from "@mui/material/Stack";
import TeenagerImg from "../../assets/NewsBoardImages/tvm-0 1.png";
import {
  NewsBlock,
  NewsContainer,
  TitleProjects,
  Pages,
} from "../../components/styles/NewsBoardStyle";
import NewsPiece from "./NewsPiece";

function NewsBoard() {
  const [currentPage, setCurrentPage] = useState<number>(1);
  const [newsPerPage] = useState<number>(6);
  const [page, setPage] = useState<number>(1);
  const handleChange = (event: React.ChangeEvent<unknown>, value: number) => {
    setPage(value);
    setCurrentPage(value);
  };

  const indexOfLastNewsPiece: number = currentPage * newsPerPage;
  const indexOfFirstNewsPiece = indexOfLastNewsPiece - newsPerPage;
  const data = [
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 1»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 2»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 3»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 4»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 5»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 6»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 7»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 8»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 9»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 10»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 11»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 12»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 13»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 14»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 15»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 16»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 17»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 18»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 19»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
    {
      image: TeenagerImg,
      title: "«Тінейджер в музеї 19»",
      shortText:
        "В Домі Франка тривала Літня школа музейних лідерів ««Тінейджер в музеї»» для учнів львівських шкіл віком від 10 до 14 років. Мета літньої школи – підвищити інтерес підлітків до культурної спадщини, сприяти їхній соціальній інтеграції та комунікації між особами з різними зацікавленнями та фізичними можливостями....",
      timeStamp: "10–15 червня 2019 р",
    },
  ];
  const currentNewsForCurrentPage = data.slice(indexOfFirstNewsPiece, indexOfLastNewsPiece);

  return (
    <NewsBlock>
      <TitleProjects>Проекти</TitleProjects>
      <NewsContainer>
        {currentNewsForCurrentPage.map((piecenews, index) => {
          return (
            <NewsPiece
              image={piecenews.image}
              title={piecenews.title}
              shortText={piecenews.shortText}
              timeStamp={piecenews.timeStamp}
              key={index}
            />
          );
        })}
      </NewsContainer>

      <Pages>
        <Stack spacing={1}>
          <Pagination
            count={
              data.length % newsPerPage !== 0
                ? Math.round(data.length / newsPerPage) + 1
                : data.length / newsPerPage
            }
            page={page}
            onChange={handleChange}
            variant='outlined'
            shape='rounded'
          />
        </Stack>
      </Pages>
    </NewsBlock>
  );
}

export default NewsBoard;
